import type { Translation } from "../@types/Translation";

export default {
  meta: {
    title: "m1xture: fullstack розробник",
    description: "",
  },
  header: {
    nav: ["Про мене", "Проєкти"],
  },
  hero: {
    title: "Вітаю! Я - m1xture",
    desc: "І я займаюсь фулстек-розробкою. Створюю сучасні вебсайти та надійні бекенд системи",
  },
  about: {
    title: "Про мене",
    description: [
      "Спочатку я вивчав фронтенд тенхнології, потім поступово Node.js та бекенд фреймворки на Javascript. Після цього захопився Java та зараз вдосконалюю свої навички у Spring",
    ],
    info: {
      startedProgramming: ["Я програмую вже", "р.", "м."],
      programmingLanguages: "Мови Програмування",
      commercialExperience: ["Комерційний досвід", "років"],
      englishLevel: "Рівень Англійської",
      location: ["Живу в", "Україні - ЄС"],
      email: "Email",
    },
  },
  projects: [
    {
      id: "femida",
      title: "Femida: Discord-бот для цілої спільноти",
      description: `Це був командний проєкт ініційований академією GoITeens. Завдання полягало в створенні багатофункціонального боту для модерації повідомлень в чаті, верифікації студентів академії, збору статистики та програми лояльності. Було реалізовано три сервіси: дашборд, backend та сам бот`,
    },
    {
      id: "roomcraft",
      title: "Roomcraft: Сайт-конструктор кімнат",
      description:
        "За 5 днів треба було реалізувати повноцінний конструктор кімнат з нуля. Ми встигли виконати всі завдання, включно з додатковими. Жюрі високо оцінили нашу роботу та присудили перше місце",
    },
    {
      id: "yummy",
      title: "So Yummy: Книга рецептів у кармані",
      description:
        "Це вебсайт з величезною кількістю рецептів. На той момент, бекенд частина вже була реалізована, тому наша команда працювала лише над фронтендом. Ви можете зберігати рецепти до улюблених, шукати їх по категоріям та навіть додати свій",
    },
  ],
} satisfies Translation;
