import type { Translation } from "../@types/Translation";

export default {
  header: {
    nav: ["Про мене", "Проєкти", "Контакти"],
  },
  hero: {
    title: "Вітаю! Я - m1xture",
    desc: "І я займаюсь фулстек-розробкою. Створюю сучасні вебсайти та надійні бекенд системи",
  },
  projects: [
    {
      id: "femida",
      title: "Femida: Discord-бот для цілої спільноти",
      description: `Це був командний проєкт ініційований академією GoITeens. Завдання полягало в створенні багатофункціонального боту для модерації повідомлень в чаті, верифікації студентів академії, збору статистики та програми лояльності. Було реалізовано три сервіси: дашборд, backend та сам бот`,
    },
    {
      id: "roomcraft",
      title: "Roomcraft: Сайт-конструктор кімнат",
      description:
        "За 5 днів треба було реалізувати повноцінний конструктор кімнат з нуля. Ми встигли виконати всі завдання, включно з додатковими. Жюрі високо оцінили нашу роботу та присудили перше місце",
    },
    {
      id: "yummy",
      title: "So Yummy: Книга рецептів у кармані",
      description:
        "Це вебсайт з величезною кількістю рецептів. На той момент, бекенд частина вже була реалізована, тому наша команда працювала лише над фронтендом. Ви можете зберігати рецепти до улюблених, шукати їх по категоріям та навіть додати свій",
    },
  ],
} satisfies Translation;
